tap "homebrew/aliases"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "homebrew/formula-analytics"
tap "homebrew/portable-ruby"
tap "homebrew/services"
tap "homebrew/test-bot"
# Search tool like grep, but optimized for programmers
brew "ack"
# Static checker for GitHub Actions workflow files
brew "actionlint"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Collection of portable C++ source libraries
brew "boost"
# Cross-platform make
brew "cmake"
# Command-line tool for DigitalOcean
brew "doctl"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# More intuitive version of du in rust
brew "dust"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Manage Procfile-based applications
brew "foreman"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# GNU version of the tar archiving utility
brew "gnu-tar"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Fast linters runner for Go
brew "golangci-lint"
# Colorize logfiles and command output
brew "grc"
# Improved top (interactive process viewer)
brew "htop"
# Command-line benchmarking tool
brew "hyperfine"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Platform built on V8 to build network applications
brew "node"
# CLI for Node.js style checker and lint tool for Markdown files
brew "markdownlint-cli"
# Mac App Store command-line interface
brew "mas"
# Install NodeJS versions
brew "node-build"
# Platform built on V8 to build network applications
brew "node@18"
# Platform built on V8 to build network applications
brew "node@20"
# Platform built on V8 to build network applications
brew "node@22"
# Manage multiple NodeJS versions
brew "nodenv"
# Optimizer for PNG files
brew "pngcrush"
# Object-relational database system
brew "postgresql@16", restart_service: true
# Wrapper to colorize and simplify ping's output
brew "prettyping"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Powerful, clean, object-oriented scripting language
brew "ruby@3.1"
# Powerful, clean, object-oriented scripting language
brew "ruby@3.2"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Linter for YAML files
brew "yamllint"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Find security issues in GitHub Actions setups
brew "zizmor"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Application uninstaller
cask "appcleaner"
# Hard disk backup and cloning utility
cask "carbon-copy-cloner"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Write, edit, and chat about your code with AI
cask "cursor"
# Elgato FACECAM configuration tool
cask "elgato-camera-hub"
# Control your Elgato key lights
cask "elgato-control-center"
cask "font-sf-mono"
cask "font-signika"
cask "font-skranji"
cask "font-space-mono"
# GIT client
cask "fork"
# Web browser
cask "google-chrome"
# Tool to prevent the system from going into sleep mode
cask "keepingyouawake"
# Automatically hides or quits apps after periods of inactivity
cask "quitter"
# Utility to resize and position application windows
cask "sizeup"
# Virtual machines UI using QEMU
cask "utm"
# Open-source code editor
cask "visual-studio-code"
# Multiplayer code editor
cask "zed"
# Video communication and virtual meeting platform
cask "zoom"
mas "1Blocker", id: 1365531024
mas "1Password for Safari", id: 1569813296
mas "GarageBand", id: 682658836
mas "In Your Face", id: 1476964367
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator Pro", id: 1289583905
mas "Refined GitHub", id: 1519867270
mas "Slack", id: 803453959
mas "StopTheMadness", id: 1376402589
mas "TouchDraw", id: 1580322028
mas "WhatsApp", id: 310633997
mas "Xcode", id: 497799835 unless File.exist?("/Applications/Xcode-beta.app")
vscode "aliariff.vscode-erb-beautify"
vscode "anykeyh.simplecov-vscode"
vscode "ban.spellright"
vscode "bradlc.vscode-tailwindcss"
vscode "davidanson.vscode-markdownlint"
vscode "davidbwaters.macos-modern-theme"
vscode "editorconfig.editorconfig"
vscode "foxundermoon.shell-format"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "heybourn.headwind"
vscode "huacnlee.theme-macos-classic"
vscode "koichisasada.vscode-rdbg"
vscode "manuelpuyol.erb-linter"
vscode "markis.code-coverage"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode.makefile-tools"
vscode "msyrus.go-doc"
vscode "redhat.vscode-yaml"
vscode "shopify.ruby-lsp"
vscode "sorbet.sorbet-vscode-extension"
vscode "standard.vscode-standard"
vscode "stylelint.vscode-stylelint"
vscode "timonwong.shellcheck"
