tap "homebrew/aliases"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "homebrew/formula-analytics"
tap "homebrew/services"
tap "homebrew/test-bot"
tap "workbrew/private", "https://#{ENV.fetch("HOMEBREW_GITHUB_API_TOKEN")}@github.com/Workbrew/homebrew-private"
# Search tool like grep, but optimized for programmers
brew "ack"
# Static checker for GitHub Actions workflow files
brew "actionlint"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Collection of portable C++ source libraries
brew "boost"
# Cross-platform make
brew "cmake"
# In-depth comparison of files, archives, and directories
brew "diffoscope"
# Command-line tool for DigitalOcean
brew "doctl"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Manage Procfile-based applications
brew "foreman"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# GNU version of the tar archiving utility
brew "gnu-tar"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Fast linters runner for Go
brew "golangci-lint"
# Colorize logfiles and command output
brew "grc"
# Improved top (interactive process viewer)
brew "htop"
# Command-line benchmarking tool
brew "hyperfine"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Platform built on V8 to build network applications
brew "node"
# CLI for Node.js style checker and lint tool for Markdown files
brew "markdownlint-cli"
# Mac App Store command-line interface
brew "mas"
# High performance, distributed memory object caching system
brew "memcached", restart_service: true
# Small build system for use with gyp or CMake
brew "ninja"
# Install NodeJS versions
brew "node-build"
# Platform built on V8 to build network applications
brew "node@18"
# Platform built on V8 to build network applications
brew "node@20"
# Manage multiple NodeJS versions
brew "nodenv"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Optimizer for PNG files
brew "pngcrush"
# Object-relational database system
brew "postgresql@15", restart_service: true
# Wrapper to colorize and simplify ping's output
brew "prettyping"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Powerful, clean, object-oriented scripting language
brew "ruby@3.1"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Linter for YAML files
brew "yamllint"
# JavaScript package manager
brew "yarn"
# Fork of youtube-dl with additional features and fixes
brew "yt-dlp"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Application uninstaller
cask "appcleaner"
# Hard disk backup and cloning utility
cask "carbon-copy-cloner"
# Elgato FACECAM configuration tool
cask "elgato-camera-hub"
# Control your Elgato key lights
cask "elgato-control-center"
cask "font-abel"
cask "font-fjalla-one"
# Variable font designed for display
cask "font-inter"
# Monospaced variant of "San Francisco" by Apple
cask "font-sf-mono"
# Sans-serif signage typeface with a gentle character
cask "font-signika"
# GIT client
cask "fork"
# Web browser
cask "google-chrome"
# Utility to fix grammar errors and style issues in text
cask "grammarly"
# Tool to prevent the system from going into sleep mode
cask "keepingyouawake"
# Orchestration with Kubernetes on Apple
cask "orka"
# Utility to resize and position application windows
cask "sizeup"
# Virtual machines UI using QEMU
cask "utm"
# Open-source code editor
cask "visual-studio-code"
# Installer for Workbrew Agent
cask "workbrew"
# Video communication and virtual meeting platform
cask "zoom"
mas "1Blocker", id: 1365531024
mas "1Password for Safari", id: 1569813296
mas "Cardhop", id: 1290358394
mas "Fantastical", id: 975937182
mas "GarageBand", id: 682658836
mas "Hush", id: 1544743900
mas "In Your Face", id: 1476964367
mas "Ivory", id: 6444602274
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator Pro", id: 1289583905
mas "Reeder", id: 1529448980
mas "Slack", id: 803453959
mas "StopTheMadness", id: 1376402589
mas "TouchDraw", id: 1580322028
mas "Vinegar", id: 1591303229
mas "WhatsApp", id: 1147396723
mas "Xcode", id: 497799835
vscode "aliariff.vscode-erb-beautify"
vscode "anykeyh.simplecov-vscode"
vscode "ban.spellright"
vscode "bradlc.vscode-tailwindcss"
vscode "DavidAnson.vscode-markdownlint"
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "foxundermoon.shell-format"
vscode "GitHub.codespaces"
vscode "GitHub.copilot"
vscode "GitHub.copilot-labs"
vscode "github.vscode-github-actions"
vscode "GitHub.vscode-pull-request-github"
vscode "golang.go"
vscode "heybourn.headwind"
vscode "huacnlee.theme-macos-classic"
vscode "kaiwood.endwise"
vscode "KoichiSasada.vscode-rdbg"
vscode "LoranKloeze.ruby-rubocop-revived"
vscode "manuelpuyol.erb-linter"
vscode "markis.code-coverage"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-yaml"
vscode "Shopify.ruby-lsp"
vscode "sorbet.sorbet-vscode-extension"
vscode "stylelint.vscode-stylelint"
vscode "timonwong.shellcheck"
vscode "Wattenberger.footsteps"
