tap "homebrew/cask"
tap "homebrew/core"
# Search tool like grep, but optimized for programmers
brew "ack"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Static checker for GitHub Actions workflow files
brew "actionlint"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# General-purpose data compression with high compression ratio
brew "xz"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# More intuitive version of du in rust
brew "dust"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Foreman clone written in Go
brew "goreman"
# Colorize logfiles and command output
brew "grc"
# Improved top (interactive process viewer)
brew "htop"
# Command-line benchmarking tool
brew "hyperfine"
# XML security library
brew "libxmlsec1"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# CLI for Node.js style checker and lint tool for Markdown files
brew "markdownlint-cli"
# Mac App Store command-line interface
brew "mas"
# Open source relational database management system
brew "mysql@8.4", restart_service: :changed
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Framework for layout and rendering of i18n text
brew "pango"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Optimizer for PNG files
brew "pngcrush"
# Fast, disk space efficient package manager
brew "pnpm"
# Wrapper to colorize and simplify ping's output
brew "prettyping"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: :changed
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Powerful, clean, object-oriented scripting language
brew "ruby@3.4"
# Safe, concurrent, practical language
brew "rust"
# Run AI agents isolated in a sandboxed macOS user account
brew "sandvault"
# Autoformat shell script source code
brew "shfmt"
# Human-friendly alternative to netstat for socket and port monitoring
brew "somo"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Syntax-aware linter for prose
brew "vale"
# Internet file retriever
brew "wget"
# Port of OpenAI's Whisper model in C/C++
brew "whisper-cpp"
# Linter for YAML files
brew "yamllint"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Find security issues in GitHub Actions setups
brew "zizmor"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Application uninstaller
cask "appcleaner"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Terminal-based AI coding assistant
cask "claude-code"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Elgato FACECAM configuration tool
cask "elgato-camera-hub"
# Control your Elgato key lights
cask "elgato-control-center"
cask "font-sf-mono"
cask "font-signika"
cask "font-skranji"
cask "font-space-mono"
# GIT client
cask "fork"
# Tool to prevent the system from going into sleep mode
cask "keepingyouawake"
# Discover, download, and run local LLMs
cask "lm-studio"
# Trims video and audio files losslessly
cask "losslesscut"
# Multi-platform web browser
cask "microsoft-edge"
# App to write, plan, collaborate, and get organised
cask "notion"
# Audiobook manager for Audible users
cask "openaudible"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Terminal for orchestrating agents
cask "superset"
# Open-source code editor
cask "visual-studio-code"
# Multiplayer code editor
cask "zed"
# Video communication and virtual meeting platform
cask "zoom"
mas "1Blocker", id: 1365531024
mas "1Password for Safari", id: 1569813296
mas "Consent-O-Matic", id: 1606897889
mas "GarageBand", id: 682658836
mas "InYourFace", id: 1476964367
mas "Keynote", id: 361285480
mas "Numbers", id: 361304891
mas "Pages", id: 361309726
mas "Parachute", id: 6748614170
mas "Pixelmator Pro", id: 1289583905
mas "Reeder", id: 1529448980
mas "Refined GitHub", id: 1519867270
mas "Slack", id: 803453959
mas "TouchDraw2", id: 1580322028
mas "WhatsApp", id: 310633997
vscode "anykeyh.simplecov-vscode"
vscode "ban.spellright"
vscode "charliermarsh.ruff"
vscode "davidanson.vscode-markdownlint"
vscode "davidbwaters.macos-modern-theme"
vscode "editorconfig.editorconfig"
vscode "foxundermoon.shell-format"
vscode "github.codespaces"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "ms-azuretools.vscode-containers"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vsliveshare.vsliveshare"
vscode "redhat.vscode-yaml"
vscode "shopify.ruby-lsp"
vscode "sorbet.sorbet-vscode-extension"
vscode "timonwong.shellcheck"
